# Смешанные мини-задания

#29. Калькулятор возраста. Запроси год рождения расчитай возраст в 2026 (f-строка).
year = int(input("Год рождения: "))
age = 2026 - year
print(f"Тебе {age} лет")

#30. Перевод температуры. Цельсий -> Фаренгейт: F = C * 9/5 + 32.
c = float(input("Температура в Цельсиях: "))
f = c * 9 / 5 + 32
print(f"Температура в Фаренгейтах: {f}")

#31. Стоимость покупки. Вводятся цена и количество. Цена × количество, если сумма > 1000 -> скидка 10%.
price = float(input("Цена: "))
quantity = int(input("Количество: "))

total = price * quantity

if total > 1000:
    total = total * 0.9

print(f"Итоговая сумма: {total}")

#32. Анкета. Запроси имя, возраст, город -> выведи все данные одной f-строкой.
name = input("Имя: ")
age = int(input("Возраст: "))
city = input("Город: ")

print(f"Имя: {name}, возраст: {age}, город: {city}")