"""
Задача 1. «Космическая регистрация»
(input, типы, f-strings, if/else, try/except, строковые методы)
Напиши программу, которая регистрирует астронавта перед полётом.

Что делает:
Спрашивает имя, фамилию и возраст.
Возраст нужно преобразовать в число. Если ввели не число, то через try/except вывести «Ошибка: возраст должен быть числом» и завершить.
Строку имени привести к виду «Имя Фамилия» с заглавных букв (первая буква — upper, остальное — lower).

Проверить условия допуска:
возраст от 25 до 55 → «Допущен к полёту»
возраст меньше 25 → «Слишком молод»
возраст больше 55 → «Слишком опытен для полёта»

Вывести карточку астронавта через f-строку:


=== КАРТОЧКА АСТРОНАВТА ===
Имя: Иван Петров
Возраст: 34
Статус: Допущен к полёту
"""


name = input("Введите имя: ")
surname = input("Введите фамилию: ")

try:
    age = int(input("Введите возраст: "))
except ValueError:
    print("Ошибка: возраст должен быть числом")
    exit()

name = name[0].upper() + name[1:].lower()
surname = surname[0].upper() + surname[1:].lower()

if 25 <= age <= 55:
    status = "Допущен к полёту"
elif age < 25:
    status = "Слишком молод"
else:
    status = "Слишком опытен для полёта"

print(f"""
=== КАРТОЧКА АСТРОНАВТА ===
Имя: {name} {surname}
Возраст: {age}
Статус: {status}
""")
